testcases/pipe_flow/0/Psi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField  nonuniform List<scalar> 4800
(
-0.4651727364385851
-0.46520791886050195
-0.46528532488080937
-0.4654029547605376
-0.4655604895407132
-0.4657578289131832
-0.4659949412571442
-0.4662718261505876
-0.46658850114286826
...
);

boundaryField
{
    perim
    {
        type            fixedValue;
        value nonuniform List<scalar> 30
        (
        -1.1536520872401306
-0.5768260436200653
-0.3845506957467101
-0.2884130218100327
-0.23073041744802603
-0.1922753478733551
-0.16480744103430434
-0.14420651090501635
-0.1281835652489034
...
        );
        
    }

        bottom
    {
        type    wedge;
    }

    top
    {
          type            wedge;
    }

    front
    {
        type            fixedValue;
        value nonuniform List<scalar> 
    160
    (
    -0.46517273643858508825
    -0.46520791886050194552
    -0.46528532488080937002
    -0.4654029547605376127
    -0.46556048954071321822
    -0.46575782891318318057
    -0.46599494125714419068
    -0.46627182615058759829
...
    );
    }

    back
    {
        type            fixedValue; 
        value nonuniform List<scalar> 
        160
        (  
0.6827573779163361
0.6827221954944193
0.6826447894741119
0.6825271595943836
0.6823696248142079
0.682172285441738
0.681935173097777
0.6816582882043336
...
        );
    }

}


// ************************************************************************* //
