testcases/pipe_flow/0/n1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      n1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.5;



boundaryField
{
    perim
    {
        type fixedValue;
        value uniform 1.5758419778233563324;
        
    }



    bottom
    {
        type    wedge;
    }

    top
    {
          type            wedge;
    }

    front
    {
        type            fixedValue;
        value nonuniform List<scalar> 
        160
        (
        0.79669260491185911466
        0.79672060695139546027
        0.79678221862935416642
        0.79687585581274267277
        0.79700127579606983019
        0.79715841375811657965
        0.79734726318575532833
        0.79756784636461053317
...
        );    
    }

back
    {
        type            fixedValue;
        value nonuniform List<scalar> 
        160
        (
        0.79669260491185911466
        0.79672060695139546027
        0.79678221862935416642
        0.79687585581274267277
        0.79700127579606983019
        0.79715841375811657965
        0.79734726318575532833
        0.79756784636461053317
...
        );
    }

}


// ************************************************************************* //
