testcases/pipe_flow/0/n2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      n2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField  uniform 0.5;

boundaryField
{

    perim
    {
        type fixedValue;
        value uniform 0.1577412466576213;
        
    }


    bottom
    {
        type    wedge;
    }

    top
    {
          type            wedge;
    }

    front
    {
        type            fixedValue;
        value nonuniform List<scalar> 
160
(
0.3137975010431575118
0.31378647210008570045
0.31376220832784246229
0.31372533951774539407
0.31367597009986558643
0.31361413735041016038
0.31353985862000294249
0.31345314279764868726
...
)
;   }

back
    {
        type            fixedValue;
        value nonuniform List<scalar> 
160
(
0.3137975010431575118
0.31378647210008570045
0.31376220832784246229
0.31372533951774539407
0.31367597009986558643
0.31361413735041016038
0.31353985862000294249
0.31345314279764868726
...
)
;   }

}


// ************************************************************************* //
