testcases/pipe_flow/0/v2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      v2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField  uniform (0 0 0);

boundaryField
{
    perim
    {
        type  zeroGradient;
    }

    bottom
    {
        type    wedge;
    }

    top
    {
          type            wedge;
    }

    front
    {
        type            zeroGradient;    }

    back
    {
        type           zeroGradient;    }

}


// ************************************************************************* //
