testcases/pipe_flow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 4.10101400028;

vertices
(
    (0.49952411079 -0.02180969368 0)
    (0.49952411079 0.02180969368 0)
    (0 0 0)
    (0.49952411079 -0.021809693681 3)
    (0.49952411079 0.02180969368 3)
    (0 0 3)
    
    
);

edges
(
    arc 0 1 (0.5 0 0)
    arc 3 4 (0.5 0 1)
);


blocks
(
    hex (2 5 3 0 2 5 4 1) (30 160 1) simpleGrading (1 1 1)
);

boundary
(
    front
    {
        type wall;
        faces
        (
            (2 0 1 2)
        );
    }

    back
    {
        type wall;
        faces
        (
            (5 3 4 5)
            
        );
    }

    top
    {
        type  wedge;
        faces
        (
            (2 5 4 1)
            
        );
    }
   bottom
    {
        type wedge;
        faces
        (
            (2 5 3 0)
            
        );
    }
    perim
    {
        type wall;
        faces
        (
            (0 1 4 3)
            
        );
    }
    
);


// ************************************************************************* //
